# running in fireeee_dclk_edge_det_no_reset/src/
read -formal fireeee_dclk_edge_det_no_reset.v
prep -top fireeee_dclk_edge_det_no_reset

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
